# Calculate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPipePlumbingFixtureFlowServer..::..Calculate Method
IPipePlumbingFixtureFlowServer Interface See Also
---
Calculate the pipe plumbing fixture flow.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
void Calculate(
	PipePlumbingFixtureFlowData data
)
```

Visual Basic
---
```text
Sub Calculate ( _
	data As PipePlumbingFixtureFlowData _
)
```

Visual C++
---
```text
void Calculate(
	PipePlumbingFixtureFlowData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.DB.Plumbing..::..PipePlumbingFixtureFlowData The input and output data of the calculation.
# See Also
IPipePlumbingFixtureFlowServer Interface
Autodesk.Revit.DB.Plumbing Namespace